//=============================================================================
//
// チュートリアル画面の背景 [bg_tutorial.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _BG_TUTORIAL_H_
#define _BG_TUTORIAL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "polygon2d.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTutorialBG :public CPolygon2D
{
public:
	CTutorialBG();
	~CTutorialBG();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CTutorialBG * Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	typedef enum
	{
		TEXTURE_NONE = -1,
		TEXTURE_KEYBOARD_GUID,	//キーボードの操作説明
		TEXTURE_JOYSTICK_GUID,	//ジョイスティックの操作説明
		TEXTURE_MAX
	}TEXTURE;
	static LPDIRECT3DTEXTURE9 m_apTexture[TEXTURE_MAX];	//テクスチャのポインタ
};
#endif