//=============================================================================
//
// ステージ選択ボタン [button_stage_select.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "button_stage_select.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_PASS ("data/TEXTURE/Button_Stage_Select.png")		//テクスチャのパス
#define SIZE (D3DXVECTOR3(400.0f,400.0f,0.0f))						//サイズ
#define ADD_SIZE (150.0f)											//サイズの加算量

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CStageSelectButton::m_pTexture = NULL;	//テクスチャのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CStageSelectButton::CStageSelectButton()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CStageSelectButton::~CStageSelectButton()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CStageSelectButton::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	//テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	//デバイスへのポインタ
		TEXTURE_PASS,					//ファイルの名前
		&m_pTexture);					//読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CStageSelectButton::TextureUnload(void)
{
	//もしテクスチャのポインタがNULLではない場合
	if (m_pTexture != NULL)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャをNULLにする
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CStageSelectButton * CStageSelectButton::Create(D3DXVECTOR3 Position)
{
	//ステージ選択ボタンのポインタ
	CStageSelectButton * pStageSelectButton = NULL;
	//ステージ選択ボタンのポインタがNULLの場合
	if (pStageSelectButton == NULL)
	{
		//ステージ選択ボタンのメモリ確保
		pStageSelectButton = new CStageSelectButton;
		//ステージ選択ボタンのポインタがNULLではない場合
		if (pStageSelectButton != NULL)
		{
			//ステージ選択ボタンの位置設定
			pStageSelectButton->SetPos(Position);
			//ステージ選択ボタンの初期化処理関数呼び出し
			pStageSelectButton->Init();
		}
	}
	//ステージ選択ボタンのポインタを返す
	return pStageSelectButton;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CStageSelectButton::Init(void)
{
	//ボタンの初期化処理関数呼び出し
	CButton::Init();
	//テクスチャの設定
	SetTexUV(0.0f, 1.0f, 0.0f, 1.0f);
	//テクスチャの割り当て
	BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CStageSelectButton::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CButton::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CStageSelectButton::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CButton::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CStageSelectButton::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CButton::Draw();
}

//=============================================================================
// プレス処理関数
//=============================================================================
void CStageSelectButton::Press(void)
{
	//押したときのサウンド再生
	PlayButtonSE(CButton::BUTTON_SE_PUSH);
	//ステージ1モードに遷移する
	CManager::StartFade(CManager::MODE_STAGE_SELECT);
}