//=============================================================================
//
// アイテム処理 [item.h]
// Author : 佐藤颯紀
//
//=============================================================================

#ifndef _ITEM_H_
#define _ITEM_H_

//=============================================================================
// インクルード
//=============================================================================
#include "scene3d.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define COLLISION_SIZE_ITEM D3DXVECTOR3(100.0f, 100.0f, 100.0f)

//=============================================================================
// クラス宣言
//=============================================================================
class CItem : public CScene3D
{
public:
	CItem();
	~CItem();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);


private:
	static LPDIRECT3DTEXTURE9		m_pTexture;
	static LPD3DXMESH				m_pMesh;
	static LPD3DXBUFFER				m_pBuffMat;
	static DWORD					m_nNumMat;
	D3DXVECTOR3						m_rot;

};

#endif // !_ITEM_H_
