//=============================================================================
//
// リザルトモード [mode_result.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _MODE_RESULT_H_
#define _MODE_RESULT_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "object.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CCoinUI;
class CGetCoinUI;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CResultMode : CObject
{
public:
	CResultMode();
	~CResultMode();
	static CResultMode * Create();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	void InitCreateAll(void);
	void Input(void);
	void LoadCreateCoin(void);
	void LoadGetCoin(void);
	CCoinUI * m_pCoinUI;		//生成されているコイン枚数UIのポインタ
	CGetCoinUI * m_pGetCoinUI;	//取得したコイン枚数UIのポインタ
	int m_nCreateCoin;
	int m_nGetCoin;
};
#endif
