//=============================================================================
//
// チュートリアルモード [mode_tutorial.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "sound.h"
#include "mode_tutorial.h"
#include "bg_tutorial.h"
#include "keyboard.h"
#include "joystick.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CTutorialMode::CTutorialMode()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CTutorialMode::~CTutorialMode()
{
}

//=============================================================================
// 生成処理関数
//=============================================================================
CTutorialMode * CTutorialMode::Create()
{
	//チュートリアルモードのポインタ
	CTutorialMode * pTutorialMode = NULL;
	//もしチュートリアルモードのポインタがNULLの場合
	if (pTutorialMode == NULL)
	{
		//チュートリアルモードのメモリ確保
		pTutorialMode = new CTutorialMode;
		//もしチュートリアルモードのポインタがNULLではない場合
		if (pTutorialMode != NULL)
		{
			//初期化処理関数呼び出し
			pTutorialMode->Init();
		}
	}
	//チュートリアルモードのポインタを返す	
	return pTutorialMode;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CTutorialMode::Init(void)
{
	//サウンドの取得
	CSound * pSound = CManager::GetSound();
	//もしサウンドのポインタがNULLではない場合
	if (pSound != NULL)
	{
		//サウンドの停止
		pSound->StopSound();
		//チュートリアルのBGMを再生
		pSound->Play(CSound::SOUND_LABEL_BGM_TUTORIAL);
	}
	//初期全生成処理関数呼び出し
	InitCreateAll();
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CTutorialMode::Uninit(void)
{
	Release();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CTutorialMode::Update(void)
{
	//入力処理
	Input();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CTutorialMode::Draw(void)
{
}

//=============================================================================
// 初期全生成処理関数
//=============================================================================
void CTutorialMode::InitCreateAll(void)
{
	//チュートリアル背景の生成
	CTutorialBG::Create();
}

//=============================================================================
// 入力処理関数
//=============================================================================
void CTutorialMode::Input(void)
{
	//キーボードの取得
	CInputKeyboard * pKeyboard = CManager::GetInput();
	//ジョイスティックの取得
	CJoystick * pJoystick = CManager::GetJoystick();
	LPDIRECTINPUTDEVICE8 lpDIDevice = CJoystick::GetDevice(JOYSTICK_1P);
	DIJOYSTATE js;
	//ジョイスティックの振動取得
	//LPDIRECTINPUTEFFECT pDIEffect = CJoystick::GetEffect(JOYSTICK_1P);
	if (lpDIDevice != NULL)
	{
		lpDIDevice->Poll();
		lpDIDevice->GetDeviceState(sizeof(DIJOYSTATE), &js);
	}
	//もしENTERキー又はジョイスティックのAボタンを押されたら
	if (pKeyboard->GetKeyboardTrigger(DIK_RETURN) || pJoystick->GetJoystickTrigger(JS_A, JOYSTICK_1P))
	{
		//タイトルモードに遷移する
		CManager::StartFade(CManager::MODE_TITLE);
	}
}