//=============================================================================
//
// 数字処理 [number.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _NUMBER_H_
#define _NUMBER_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_NUMBER (2)

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CNumber
{
public:
	CNumber();
	~CNumber();
	static HRESULT TextureLoad(void);
	static void TextureUnload(void);
	static CNumber* Create(D3DXVECTOR3 Position, D3DXVECTOR3 Size);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void SetNumber(int nNumber);
	void SetPostion(D3DXVECTOR3 Position);
	void SetSize(D3DXVECTOR3 Size);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	// テクスチャへのポインタ
	LPDIRECT3DVERTEXBUFFER9   m_pVtxBuff;	//頂点バッファへのポインタ
	D3DXVECTOR3 m_Position;					//位置
	D3DXVECTOR3 m_Size;						//サイズ
};
#endif